{
  "name": "Michael Dovhalov",
  "position": "FullStack Software Engineer",
  "contacts": {
    "email": "m.dovhalov@squikable.com",
    "github": {
      "link": "https://github.com/Squikle",
      "label": "github.com/Squikle"
    },
    "linkedin": {
      "link": "https://www.linkedin.com/in/dovhalov/",
      "label": "linkedin.com/in/dovhalov/"
    },
    "phoneNumber": "+1 (416) 414-6089",
    "phoneNumberSecondary": "+380 (95) 689-51-73",
    "telegram": {
      "link": "https://t.me/squikle",
      "label": "t.me/squikle"
    },
    "location": "Toronto, ON, Canada",
    "locationLink": "https://maps.app.goo.gl/CZQjbmQuShKgXZkA6",
    "pdfResume": "./Michael Dovhalov CV.pdf"
  },
  "greeting": "Hey there! Thank you for visiting my portfolio page. It has been fully designed and developed by me",
  "description": "I am a hardworking and motivated developer. My main focus is\nbackend development but my experience also includes frontend\nand devops areas",
  "jobs": [
    {
      "company": "Bitcoin Suisse",
      "period": "2023 - 2024",
      "location": "Zug, Switzerland",
      "position": "FullStack Engineer",
      "description": "A crypto-oriented banking application. Bitcoin Suisse leads the market in cryptocurrency investments, offering institutional brokerage services, custody solutions, staking, and secured loans, alongside cutting-edge technical developments. With over 300 employees, Bitcoin Suisse maintains its position as a Swiss pioneer in the crypto industry.",
      "highlights": [
        {
          "title": "Technical Contributions Highlights:",
          "bullets": [
            "Developed a clustered microservice capable of handling hundreds of thousands of requests per second with below second latency, significantly enhancing backend reliability and performance",
            "Solved dozens of different problems, including security,performance,processing of huge data streams, making efficient architectural decisions and improving the quality and functionality of the product",
            "Made a major contribution to CI/CD automating the deployment of microservices in a cluster, greatly accelerating the speed and efficiency of product development",
            "Skills and Tech: C#, ASP.NET, React.js, TypeScript, JavaScript, Blazor, Kafka, Azure, MicrosoftSQL, Docker, Kubernetes, Grafana, Azure Pipeline, Microsoft Orleans, k6, Restful API, Postman, Git, Azure DevOps, web applications"
          ]
        }
      ]
    },
    {
      "company": "upSWOT",
      "period": "2021 - 2023",
      "location": "South Carolina, USA",
      "position": "Software Engineer",
      "description": "Developed integrations with other systems, cloud integration, backend for client-facing frontend, authorization mechanisms, integration tests, ci/cd pipelines, etc. upSWOT is a fintech startup offering customizable embedded finance widgets and actionable insights for businesses. Trusted by 100+ multinational financial institutions and partnered with industry leaders like Mastercard, Visa, NCR, NerdW",
      "highlights": [
        {
          "title": "Product Team Highlights:",
          "bullets": [
            "Developed multi-tenant SaaS accommodating hundreds of parallel tenants per application instance, exceeding gigabyte-scale throughput",
            "Led backend development in the team, onboarded and mentored 3 newcomers to the team, allowing them to quickly get up to speed on work processes",
            "Identified and fixed over 25+ potential vulnerabilities, enhancing product security for penetration testing and SOC2 certification",
            "Integrated with more than 10 partners solutions using Rest API, OAuth, OIDC, and SAML significantly expanding the innovative functionality of the product with strict performance requirements",
            "Repeatedly took initiative by making improvements to scrum processes improving the process and efficiency of development within the team",
            "Skills and Tech: C#, SQL, ASP.NET, MySQL, MongoDB, Kafka, Redis, Docker, Kubernetes, GitLab ci/cd, Websockets, OAuth, SAML, Clickhouse, Grafana, JavaScript, REST Web Services, Postman, Linux, Google Cloud, ADO.NET, JIRA, NoSQL, business development, test-driven production code, GitFlow, PostgreSQL"
          ]
        },
        {
          "title": "Customer-Support Team Highlights:",
          "bullets": [
            "Engaged in dozens of client calls and supported client environments to provide technical expertise and recommend optimal integration solutions, successfully executing contracts and significantly increasing company revenue through successful deals",
            "Prepared and presented workflow, deployment, architecture, use-case sequence, and data-flow diagrams to help partners understand technical processes"
          ]
        }
      ]
    }
  ],
  "skills": [
    "Hard worker",
    "Proactive",
    "Backend, Frontend",
    "Containerization",
    "Microservices Architecture",
    "Cloud Computing Services",
    "CI/CD",
    "OOP, DDD, SOLID, Design Patterns",
    "Clean architecture and code",
    "Integration, Unit and Stress testing",
    "Multithreading, Asynchronous Programming"
  ],
  "stack": {
    "backend": [
      "C#",
      "ASP.NET",
      "SQL (MySQL, PostgreSQL)",
      "Kafka",
      "Node.js",
      "WebSockets",
      "Redis",
      "MongoDB",
      "Elasticsearch"
    ],
    "frontend": {
      "tools": [
        "React.js",
        "Redux",
        "JavaScript, TypeScript",
        "HTML, CSS"
      ],
      "libs": [
        "tsParticles (particles.js)",
        "GSAP",
        "Swiper"
      ]
    },
    "infrastructure": [
      "Docker",
      "Kubernetes",
      "AWS, Azure",
      "GitHub Actions, GitLab CI/CD",
      "NGinx"
    ]
  },
  "certificates": [
    {
      "label": "AWS Certified Cloud Practitioner",
      "img": "./badges/AWS_Certified_Cloud_Practitioner.png",
      "link": "https://www.credly.com/badges/771bd528-c1fc-4959-ad4c-2cd437150893/public_url"
    }
  ],
  "education": [
    {
      "title": "State University of Telecommunications",
      "location": "Kyiv, Ukraine",
      "degree": "Bachelor of Software Engineer",
      "status": "Completed in 2022"
    }
  ]
}